/****************************************Copyright (c)**************************************************
**                                
**                                 西南科技大学计算机学院
**                                   
**                                http://cs.swust.edu.cn
**            
**             日期：   2004.11.8
**             描述：   config.h，系统头文件，用于定义数据类型和系统时钟，
**                      同时可以根据需要设置系统模块类型。特定数据类型。            
**
**--------------config头文件;********************************************************************************************************/
/********************************************************************************************************/
//这一段无需改动
#ifndef TRUE
#define TRUE  1
#endif

#ifndef FALSE
#define FALSE 0
#endif

typedef unsigned char  uint8;                   /* 无符号8位整型变量                        */
typedef  signed  char  int8;                    /* 有符号8位整型变量                        */
typedef unsigned short uint16;                  /* 无符号16位整型变量                       */
typedef signed   short int16;                   /* 有符号16位整型变量                       */
typedef unsigned int   uint32;                  /* 无符号32位整型变量                       */
typedef signed   int   int32;                   /* 有符号32位整型变量                       */
typedef float          fp32;                    /* 单精度浮点数（32位长度）                 */
typedef double         fp64;                    /* 双精度浮点数（64位长度）                 */

/********************************/
/*      ARM的特殊代码           */
/********************************/
//加载特定芯片头文件，该头文件适合所有philip ARM芯片

#include    "LPC2200.h"


/********************************/
/*     应用程序配置             */  
/********************************/
//根据实际需要情况进行改动

/********************************/
/*      通常的配置             */
/********************************/ 
/* 系统设置, Fosc、Fcclk、Fcco、Fpclk必须定义*/
#define Fosc            11059200                    //晶振频率,10MHz~25MHz，应当与实际一至
#define Fcclk           (Fosc * 4)                  //系统频率，必须为Fosc的整数倍(1~32)，且<=60MHZ
#define Fcco            (Fcclk * 4)                 //CCO频率，必须为Fcclk的2、4、8、16倍，范围为156MHz~320MHz
#define Fpclk           (Fcclk / 4) * 1             //VPB时钟频率，只能为(Fcclk / 4)的1 ~ 4倍

#include    "target.h"              //加载外部变量定义

/*********************************************************************************************************
**                            End Of File
********************************************************************************************************/
