/****************************************Copyright (c)**************************************************/
/**                                
;**             日期：   2007.8.17
;**             描述：   time.h 定时器定义头文件。为time.c文件提供宏以及为其他函数提供调用参数
;**                    
;**
;**--------------time.h文件
;**------------------------------------------------------------------------------------------------------*/

#include "config.h"

#ifndef _TIME_H_
#define _TIME_H_

#define Time0_Enable  //定时器0功能定义允许
//#define Time1_Enable  //定时器1功能定义允许

/************************************************
 *Function declaration segment                  *
 ***********************************************/
extern void Time0Init(uint32 div, uint32 ovf);  //初始化定时器0
extern void Time0Start(void);    //启动定时器0
extern void Timer1Init(uint32 div, uint32 ovf); //初始化定时器1
extern void Time1Start(void);    //启动定时器1

#endif

/******************************************************************************
 * End of Entire File                                                         *
 *****************************************************************************/