/****************************************Copyright (c)**************************************************/
/**                                
;**             日期：   2007.8.17
;**             描述：   time.c，定时器初始化及控制文件。用于初始化定时器和启动定时器，对应的宏为
;**                      Timer0_Enable和Timer1_Enalbe。根据定时器的使用来定义TIMER0和TIEMR1，
;**                      在TARGET.c中的targetint函数中,可调用相应的TIMER0INIT(div,ovf)或TIMER1INIT(div,ovf)
;**                      进行初始化，其中Div为分频系数，可以任何数据，表示PCLK的div+1记数，ovf为溢出数据
;**                      ，定时期采用以ovf为边界的循环记数，同时产生中断，T0_InterruptSet and 
;**                      T1_InterruptSet两个函数为两定时器的中断设置，包括中断 类型设置，中断优先级的设置
;**                     ，中断使能等.
;**
;**--------------time.c文件
;**------------------------------------------------------------------------------------------------------*/

/************************************************
 *Header file         segment                   *
 ***********************************************/
#include "config.h"
#include "led.h"    //数码管
#include "time.h"

/************************************************
 *Function definition segment                   *
 ***********************************************/
 
/*-----------------------------------------------------------------*/
/*--------------------------定时器0部分----------------------------*/
/*-----------------------------------------------------------------*/
#ifdef Time0_Enable

/************************************************************
    函数名:   IRQ_Timer0Interrupt(void)
    描  述:   定时器0中断溢出处理程序，直接添加中断服务代码于此
************************************************************/
void __irq IRQ_Time0Interrupt(void)
{
    /*------------------可在此添加中断服务程序--------------------*/
    LedScan();   //数码管显示扫描函数
    
    T0IR = 0x01; //复位MR0中断
    VICVectAddr=0x00;//清除地址
}

/***************************************************************
  函数名:  Timer0_InterruptSet
  功  能: 定时器0中断设置，包括中断类型，中断优先级，地址分配，中断使能
****************************************************************/
void Time0_InterruptSet(void)
{
    VICIntSelect &= 0xffffffef;  // 设置中断类型(定时器0中断为IRQ,其它为FIQ)
    VICVectCntl2 = 0x24;   //优先级分配(2).定时器0中断为4号中断,且使能定时器0中断
    VICVectAddr2 = (int)IRQ_Time0Interrupt; //传送中断服务程序的入口地址
    VICIntEnable = 0x00000010;  //允许定时器0中断源产生中断
}

/*************************************************************** 
函数名:  Time0Init(uint32 div, uint32 ovf)
功  能:  定时器0初始化函数，根据需要设置分频值
         和定时器溢出值，定时器工作方式组合可以在里面设置
****************************************************************/


#endif

/*-----------------------------------------------------------------*/
/*--------------------------定时器1部分----------------------------*/
/*-----------------------------------------------------------------*/

#ifdef Time1_Enable

/************************************************************
    函数名:   IRQ_Timer1Interrupt(void)
    功  能:   定时器1中断溢出处理程序，直接添加中断服务代码于此
************************************************************/
void __irq IRQ_Time1Interrupt(void)
{
    /*------------------可在此添加中断服务程序--------------------*/
    T1IR = 0x01; //清除中断
    VICVectAddr = 0x00; //清除地址
}

/***************************************************************
  函数名: Timer1_InterruptSet(void)
  功  能: 定时器1中断设置，包括中断类型，中断优先级，地址分配，中断使能
****************************************************************/
void Time1_InterruptSet(void)
{
    VICIntSelect &= 0xffffffdf;// 设置中断类型(定时器1中断为IRQ,其它为FIQ)
    VICVectCntl3 = 0x25; //优先级分配(3).定时器1中断为5号中断,且使能定时器1中断
    VICVectAddr3 = (int)IRQ_Time1Interrupt; //传送中断服务程序的入口地址
    VICIntEnable = 0x00000020;  //允许定时器1中断源产生中断
}

/***************************************************************
  函数名: Timer1Init(uint16 div,uint32 ovf)
  功  能: 定时器1初始化函数，根据需要设置分频值
          和定时器溢出值，定时器工作方式组合可以在里面设置
****************************************************************/
void Timer1Init(uint32 div, uint32 ovf)
{
    T1PR = div;   //分频值( 定时器计数时钟频率 = Fpclk/(div + 1) )
    T1MCR = 0x03;  //MR0与TC值的匹配将产生中断,并使TC复位
    T1MR0 = ovf;  //匹配值,可以认为是定时器的溢出值
    //T0TCR = 0x03; //TC0开始计数并复位.
    Time1_InterruptSet();
}

/****************************************************************
 函数名:  Timer1Start(void)
 功  能:  定时器1启动，在应用程序需要处调用
*****************************************************************/
void Time1Start(void)
{
    T1TCR = 0x01; //定时器1开始计数
}

#endif

/******************************************************************************
 * End of Entire File                                                         *
 *****************************************************************************/