/****************************************Copyright (c)**************************************************/
/**                                
;**                                 西南科技大学计算机科学学院
;**                                   
;**                                http://www.cs.suswt.edu.cn
;**            
;**             日期：   2006.4.1
;**             描述：   led.h 西南科技大学计算机学院CS-II型实验板数码管工作程序头文件
;**                      
;**
;**--------------led.h文件
;**------------------------------------------------------------------------------------------------------*/

/**------------------------------------------------------------------------------------------------------
********************************************************************************************************/

#ifndef _LED_H_
#define _LED_H_

#define Led_Enable

#include "config.h"

/***************************************************************
    端口功能:
                P0.17    SCK
                P0.19    键盘反馈
                P0.18    SI 
                P0.20    RCK
*****************************************************************/
#define LedSmat 0xfffffc03 //P0.17  P0.18  P0.19  P0.20 设置为GPIO 
#define Led_SCK 0x00020000 // SCK    SI     //     RCK    
#define Led_SI  0x00040000
#define Led_RCK 0x00100000

extern void LedInit(void);  //端口功能初始化
extern void LedPrint(uint32 data);  //Print 要显示的32位数
extern void LedScan(void);   //扫描
extern void LedSend(uint8 code, uint8 place);  //发送数据(即端口扩展),
                                               //code 为显示的内容
                                               //place 为位选

#endif